(function () {
    "use strict" // страница создана в файле index.js

    window.App.videos = [
      {
            id: '4472721',
            type: 'vod',
            imgurl: 'https://st.kp.yandex.net/images/film_iphone/iphone360_4472721.jpg',
            title: 'Суперсмерч',
            titleEng: 'Supercell',
            created: '2023',
            filmPageId: 'filmid4472721',
            actors: 'Алек Болдуин,Энн Хеч,Скит Ульрих,Дэниэл Димер,Прая Лундберг,Джонни Уэктор,Ричард Ганн,Джордан Кристин Симон,Анжул Нигам,Tyler W. Gaisford',
            director: 'Херберт Джеймс Уинтерстерн',
            country: 'США',
            text: 'История подростка, который сбегает из дома, чтобы пойти по стопам своего отца, легендарного охотника за штормами Билла Броуди....',
            status: 'film'
          },
          {
            id: '5072664',
            type: 'vod',
            imgurl: 'https://st.kp.yandex.net/images/film_iphone/iphone360_5072664.jpg',
            title: 'Из моего окна: За морями',
            titleEng: 'A través del mar',
            created: '2023',
            filmPageId: 'filmid5072664',
            actors: 'Клара Галле,Хулио Пенья Фернандес,Уго Арбуэс,Эрик Масип,Наталия Асахара,Гильермо Лашерас,Эмилия Лазо,Andrea Chaparro,Ivan Lapadula Montes,Карла Тоус',
            director: 'Марсаль Форес',
            country: 'Испания',
            text: 'После того, как Арес уехал на учебу в Стокгольм, Ракель пытается поддерживать отношения с ним на расстоянии. Она с нетерпением ждет наступления лета, чтобы вновь увидеть своего любимого. Но время, проведенное друг без друга, наложило неизгладимый отпечаток на чувства, которые оба считали незыблемыми...',
            status: 'film'
          },
          {
            id: '4745766',
            type: 'vod',
            imgurl: 'https://st.kp.yandex.net/images/film_iphone/iphone360_4745766.jpg',
            title: 'Ты ранил мои чувства',
            titleEng: 'You Hurt My Feelings',
            created: '2023',
            filmPageId: 'filmid4745766',
            actors: 'Джулия Луи-Дрейфус,Тобайас Мензис,Микаэла Уоткинс,Ариан Моайед,Оуэн Тиг,Эмбер Тэмблин,Дэвид Кросс,Зак Черри,ЛаТаня Ричардсон Джексон,Сара Стил',
            director: 'Николь Холофсенер',
            country: 'США',
            text: 'Известная писательница Бет решает расстаться с мужем Доном после долгих лет брака из-за его нелестной оценки ее нового романа....',
            status: 'film'
          },
          {
            id: '4477067',
            type: 'vod',
            imgurl: 'https://st.kp.yandex.net/images/film_iphone/iphone360_4477067.jpg',
            title: 'Уикенд с батей',
            titleEng: 'About My Father',
            created: '2023',
            filmPageId: 'filmid4477067',
            actors: 'Себастьян Манискалко,Роберт Де Ниро,Лесли Бибб,Андерс Холм,Дэвид Раш,Ким Кэтролл,Бретт Дайер,Дебора Такер,Лаура Олт,Andrea Garnett',
            director: 'Лора Террузо',
            country: 'США',
            text: 'Себастьян планирует провести уикенд со своей очаровательной невестой Элли и ее семьей в их роскошном фамильном поместье, где есть собственное поле для гольфа, шикарная яхта и даже ручной павлин. Отличный план на длинные выходные, но Элли настаивает, чтобы Себастьян также пригласил своего отца Сальво...',
            status: 'film'
          },
          {
            id: '927898',
            type: 'vod',
            imgurl: 'https://st.kp.yandex.net/images/film_iphone/iphone360_927898.jpg',
            title: 'Переводчик',
            titleEng: 'The Covenant',
            created: '2023',
            filmPageId: 'filmid927898',
            actors: 'Джейк Джилленхол,Александр Людвиг,Энтони Старр,Эмили Бичем,Дар Салим,Джейсон Вонг,Бобби Шофилд,Свен Теммел,Фахим Фазли,Шон Сагар',
            director: 'Гай Ричи',
            country: 'Великобритания,Испания',
            text: 'Служба сержанта Джона Кинли в Афганистане подходит к концу. В один из последних дней он отправляется на задание вместе с проводником по имени Ахмед. Их группа попадает под обстрел, и только раненому Кинли с Ахмедом удается выжить. За ними начинается погоня, и Ахмед, рискуя своей жизнью, помогает Кин...',
            status: 'film'
          },
          
    ] 
  })();
  