(function () {
    "use strict"

    window.App.searchedVideos = [
      {
            filmPageId: 'filmid10497310',
            id: '10497310',
            kinopoisk_id: '1049731',
            type: 'vod',
            imgurl: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1049731.jpg',
            title: 'Черный клевер',
            titleEng: 'Black Clover',
            created: '2017',
            actors: 'Гакуто Кадзивара, Симадзаки Нобунага, Кана Юки, Такума Тэрасима, Аюму Мурасэ, Асука Ниси, Дзюнъити Сувабэ, Дзюн Фукуяма, Кэнъитиро Мацуда, Гэнки Муро',
            director: 'Тацуя Ёсихара, Роко Огивара, Аятака Танэмура',
            country: 'Япония',
            text: 'Ещё младенцами в один и тот же день Аста с Юно были подброшены под двери церкви одной отдалённом деревни. Годы шли, мальчики росли, а миром вокруг них правила магия. Юно оказался по-настоящему одарённым чародеем, а Аста не мог освоить и простейшее заклинание. На пятнадцатый день рождения юноши получат свою собственную книгу заклинаний - гримуар. Лучшие друзья в прошлом, а ныне - соперники, они делят одну мечту на двоих. Каждый из них хочет стать Королём-чародеем.',
          },
          {
            filmPageId: 'filmid10497311',
            id: '10497311',
            kinopoisk_id: '1049731',
            type: 'vod',
            imgurl: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1049731.jpg',
            title: 'Черный клевер',
            titleEng: 'Black Clover',
            created: '2017',
            actors: 'Гакуто Кадзивара, Симадзаки Нобунага, Кана Юки, Такума Тэрасима, Аюму Мурасэ, Асука Ниси, Дзюнъити Сувабэ, Дзюн Фукуяма, Кэнъитиро Мацуда, Гэнки Муро',
            director: 'Тацуя Ёсихара, Роко Огивара, Аятака Танэмура',
            country: 'Япония',
            text: 'Ещё младенцами в один и тот же день Аста с Юно были подброшены под двери церкви одной отдалённом деревни. Годы шли, мальчики росли, а миром вокруг них правила магия. Юно оказался по-настоящему одарённым чародеем, а Аста не мог освоить и простейшее заклинание. На пятнадцатый день рождения юноши получат свою собственную книгу заклинаний - гримуар. Лучшие друзья в прошлом, а ныне - соперники, они делят одну мечту на двоих. Каждый из них хочет стать Королём-чародеем.',
          },
          {
            filmPageId: 'filmid10497312',
            id: '10497312',
            kinopoisk_id: '1049731',
            type: 'vod',
            imgurl: 'https://st.kp.yandex.net/images/film_iphone/iphone360_1049731.jpg',
            title: 'Черный клевер',
            titleEng: 'Black Clover',
            created: '2017',
            actors: 'Гакуто Кадзивара, Симадзаки Нобунага, Кана Юки, Такума Тэрасима, Аюму Мурасэ, Асука Ниси, Дзюнъити Сувабэ, Дзюн Фукуяма, Кэнъитиро Мацуда, Гэнки Муро',
            director: 'Тацуя Ёсихара, Роко Огивара, Аятака Танэмура',
            country: 'Япония',
            text: 'Ещё младенцами в один и тот же день Аста с Юно были подброшены под двери церкви одной отдалённом деревни. Годы шли, мальчики росли, а миром вокруг них правила магия. Юно оказался по-настоящему одарённым чародеем, а Аста не мог освоить и простейшее заклинание. На пятнадцатый день рождения юноши получат свою собственную книгу заклинаний - гримуар. Лучшие друзья в прошлом, а ныне - соперники, они делят одну мечту на двоих. Каждый из них хочет стать Королём-чародеем.',
          },
          
    ] 
  })();
  